[
    {
        "image": "./images/carlos.png",
        "name": "Carlos LaRiva",
        "title": "Head Pro",
        "bio": "Carlos is originally from Venezuela, and has also lived in Germany and Colombia. For the past 15 years Carlos has lived in Boca Raton, Florida where for the past 9 years he has taught at a Country Club. He also trained and coached at the Pro World Tennis Academy with world top ranked players such as Naomi Osaka. Carlos is great with both kids and adults and specializes in advance tournament players. Carlos is an experienced and dedicated teacher who is returning for his eigth year at Buckskill. Carlos runs our Junior Program as well as teaching adult private lessons and clinics. He also enjoys playing Pickle Ball."
    }, 
    {
        "image": "./images/anett.png",
        "name": "Anett Ferenczi-Bako",
        "title": "Head Pro",
        "bio": "Anett was born in Budapest, Hungary where she was a top ranked junior tennis player. She competed in several ITF tournaments and at age 16 won both the singles and doubles titles at the British Columbia National Tournament in Canada. Anett went on to play Division I college tennis on a full scholarship at University of Nevada, Las Vegas. While at the UNLV, she helped to lead the Rebels to the 2013 Mountain West Conference Championship. She was also a four-time Mountain West Scholar-Athlete and Intercollegiate Tennis Association (ITA) Scholar-Athlete.\n\nAs a tennis pro, Anett coached local junior players at Himmelheber Tennis in Las Vegas, NV. She also has experience in conducting adult clinics and private lessons from her time at the Cosmopolitan Hotel, Westgate Resort and Sportime, NY where she frequently worked with all ages and levels. From 2016-2018 Anett was a Division I Head Women’s Tennis Coach at Wagner College, NY while she pursued her MBA in Finance. She is returning to Buckskill for her fourth year."
    }, 
    {
        "image": "./images/brandon.png",
        "name": "Brandon Sweeney",
        "title": "Staff Pro",
        "bio": "Brandon Sweeney was born and raised in San Jose, Costa Rica. He began playing competitive tennis at the age of 11 and became the third ranked player in the country by the age of 12. At 14, he was ranked #5 in Central America for singles and #1 for doubles and was the National singles and doubles champion. He was invited by the Costa Rican Tennis Federation to play Junior Davis Cup twice (only the top 3 players of every country get invited). At 15 he moved to Florida and quickly became a 4-star recruit, reaching a high of #15 in the state of Fl and #65 in the US.\n\nBrandon was recruited to play tennis at Francis Marion University where he posted a record of 18-12 his freshman year and went on to take the #1 spot for the team his sophomore year.\n\nBrandon has coached in Bradenton, Florida over the past few years as well as Mamaroneck, NY last summer. He is passionate about tennis and loves sharing his knowledge with children and adults. He says nothing makes him happier than seeing his client reach their full potential especially when they didn't know they had in them.\n\nFun Fact: After winning nationals in 2014, he got invited to have dinner with the President of Costa Rica. Brandon is returning for his second season at Buckskill."
    }, 
    {
        "image": "./images/leo.png",
        "name": "Leo Zancheta",
        "title": "Staff Pro",
        "bio": "Leo was born in Assis, Brazil. He started to play tennis at the age of 9 and went on to play national competition such as COSAT and federations tournaments. At age 15, he was ranked 16 in his age group.\n\nIn 2017, Leo committed to a junior college in University of South Carolina where he helped the team to be ranked top 10 in the country. Leo played number one in the lineup for singles and doubles in both two years as well as made to the national tournament losing in the second round on both years and reaching to the semifinals in doubles.\n\nLeo is a senior at Newberry College with a major in Business Administration and a minor in Accounting. Leo has experience coaching at Assis Tennis Club in Brazil. He also helped his brother to reach 700 on ITF ranking. Leo is very excited to work at Buckskill Tennis Club this summer!"
    }, 
    {
        "image": "./images/nik.png",
        "name": "Niklas von Hellens",
        "title": "Staff Pro",
        "bio": "Nik is originally from Thomasville, Georgia and is currently a sophomore playing Division I Men’s tennis for Belmont University in Nashville, Tennessee. Nik spent his freshman year playing for the University of Georgia, before transferring to Belmont.\n\nFor the past 14 years, Nik has been playing USTA, UTR and ITF international tournaments. Nik has been coached and trained by Grant Doyle and Lleyton Hewitt at Albany Tennis Academy in Nassau, Bahamas.\n\nAs an outgoing coach and player, Nik enjoys hitting with all ages from juniors to adults. Nik has had coaching experience at his home club with youth summer camps as well as experience hitting with adult members. Nik also spent 5 years as a private racquet stringer. Nik is a dedicated hard worker that wants to give the best coaching experience for his players. In his free time, he enjoys playing golf.\n\nNik is excited for his first summer with Buckskill Tennis Club and is eager to share his lifetime of tennis experience with club members."
    }, 
    {
        "image": "./images/rodrigo.png",
        "name": "Rodrigo Crespo",
        "title": "Staff Pro",
        "bio": "Rodrigo was born and raised in Costa Rica. He has been playing tennis since the age of 6 and at the age of 10 he started traveling to be able to play competitive tennis.\n\nRodrigo was as high as 439 ITF and was number 1 of Costa Rica from U12 until U18. He was selected to play Junior Davis Cup twice and Davis Cup three times.\n\nPlayed Division 1 college tennis for Western Michigan University and one year later he transferred to University of North Florida and been there since then. He is majoring in International Business.\n\nRodrigo has experience coaching every age group at Jacksonville Florida, and he is very passionate about the technical side of tennis and how fun it can be to play tennis.\n\nRodrigo is joining Buckskill Tennis Club for his first season and he is happy to be here!"
    }, 
    {
        "image": "./images/hugo.png",
        "name": "Hugo Lobo",
        "title": "Staff Pro",
        "bio": "Hugo is from Toulon, France. He started playing tennis at 5 years old and he played many tournaments growing up.\n\nIn 2017, Hugo decided to play college tennis in the USA. He spent his freshman and sophomore year at Steward County Community College, where he earned NJCAA All-American honors as a singles player and was an ITA Doubles All-American. Hugo with his team was a two times NJCAA Region Champion in 2018 & 2019.\n\nHe transferred to Mercer University, where he played number 1 singles and number 1 doubles in his junior and senior years.\n\nHugo is currently studying at East Tennessee State University, where his team won the Southern Conference Championship in 2022.\n\nHugo has experience coaching every age group and all levels. He was sparring partner for top players such as Eugenie Bouchard, Marta Kostyuk, Katarina Steward and Antoine Hoang. Hugo is looking forward to sharing his knowledge and experience with everyone at Buckskill Tennis Club!"
    }, 
    {
        "image": "./images/anon.png",
        "name": "Ben Letzer",
        "title": "Staff Pro",
        "bio": ""
    }, 
    {
        "image": "./images/gideon.png",
        "name": "Gideon Yektai",
        "title": "Staff Pro",
        "bio": "Gideon has been a part of the Buckskill Family since he was 2 years old! He grew up playing tennis on our grass courts.\n\nGideon played for the Ross School Varsity team starting in 7th grade! He then went on to play for the Deerfield Academy Varsity team all four years of High School.\n\nGideon started helping with the Buckskill Junior Clinics when he was 13 and this year marks his ninth year teaching at Buckskill! He is a naturally gifted tennis player who is extremely popular with kids and adults and teaches both private and group lessons. Gideon will be entering his senior year at Brown University this Fall."
    }, 
    {
        "image": "./images/anon.png",
        "name": "Will O'Brian",
        "title": "Staff Pro",
        "bio": ""
    }
]
